{
  "navigation": {
    "home": "الرئيسية",
    "blog": "المدونة",
    "about": "عني",
    "contact": "تواصل"
  },
  "footer": {
    "copyright": "© { year } العمر. جميع الحقوق محفوظة.",
    "acknowledgments": "إشادات",
    "credits": "الأيقونات من <lucideLink>Lucide</lucideLink> والرسوم التوضيحية من <illustrationLink>Storyset</illustrationLink>."
  },
  "home": {
    "intro": {
      "title": "أهلاً! أنا اسمي العمر، وأحب <br></br> تصميم <accent>تجارب مميزة</accent>",
      "description": "أنا مطور ويب ومصمم واجهات، ذو خبرة بالتصوير والتصاميم الفعالة. بعيدا عن ذلك، أمارس وقتي <blog>بالكتابة</blog>،  والتقاط الصور، وممارسة بعض الرياضة. ابقَ هنا وألقِ نظرة على أعمالي!"
    },
    "expertise": {
      "title": "خبرات <accent>وتجارب</accent>",
      "designTitle": "تصميم هادف",
      "designDescription": "تصاميمي تهدف <strong>لشيء اساسي</strong>: حل المشكلات وتبسيط التجارب. من خلال التركيز على احتياجات المستخدم الأساسية، أصمم حلولاً واضحة وفعالة وذات تأثير دائم.",
      "developTitle": "تطوير متقن",
      "developDescription": "الموازنة بين <strong>الجودة</strong> و<strong>كفاءة الوقت</strong> ليست سهلة، لكن إيجاد الحل الأمثل هو ما أتفوق فيه. في كل مشاريعي أتبع طريقة منهجية ومفصلة بشكل مدقق، مما يضمن التميز والتسليم في الوقت المحدد. (ولا مكتب عملي ليس بهذا الشكل مثل الصورة)",
      "readMore": "اقرأ المزيد عني"
    },
    "work": {
      "title": "بعض <accent>أعمالي</accent>"
    },
    "blog": {
      "title": "مقالات ومدونات",
      "readMore": "اقرأ المزيد"
    },
    "contact": {
      "title": "هذا كل <space></space><accent>شيء!</accent>",
      "description": "لقد وصلت إلى النهاية، شكراً لزيارتك! لأي استفسارات، لا تتردد في النقر على الزر أدناه. أو يمكنك لعب غزاة الفضاء.",
      "getInTouch": "تواصل معي"
    },
    "spaceInvaders": {
      "play": "العب",
      "highScore": "أعلى نتيجة",
      "instructions": "[مسطرة المسافة] للتصويب، [→] و[←] للتحرك"
    }
  },
  "contact": {
    "dropMessage": "أرسل <accent>رسالة</accent>",
    "desciption": "انقر على الزر أدناه لفتح تطبيق البريد الإلكتروني الخاص بك (كالسحر!). أعترف، تخطيت إنشاء نموذج مخصص بحقل مفيد واحد فقط. بدلاً من ذلك، يمكنك إرسال نكتتك المفضلة، أو مجرد إلقاء التحية!",
    "sendEmail": "إرسال بريد إلكتروني",
    "helloThere": "مرحباً بك",
    "dadJoke": "لماذا لا تتقاتل الهياكل العظمية؟ لأنها لا تملك الشجاعة!"
  },
  "about": {
    "intro": {
      "title": "خلف العمل: <br></br> مساري <accent>الإبداعي</accent>",
      "description": "حيث تلتقي البكسلات مع الهدف: صياغة حلول رقمية من خلال التصميم والبرمجة وحل المشكلات بإبداع، مدفوعاً بعين المصور وعقل المطور."
    },
    "photography": {
      "title": "بدأت مع <br></br> <accent>التصوير</accent>",
      "description": "التصوير الفوتوغرافي في حمضي النووي، رغم أنني قليلاً صدئ. مع كون والديّ مصورين، نشأت منغمساً في إبداعهما. أتقنت فوتوشوب مبكراً، محولاً الصور العادية إلى ملاعبي: كنت أضع الناس بين السحب، أو أحول ملابسهم إلى أزياء غريبة. هذه المغامرات المبكرة في الفن الرقمي أشعلت رحلتي في التصميم."
    },
    "design": {
      "title": "استكشفت <accent>التصميم</accent>",
      "description": "لم يكن التصميم وحياً مفاجئاً بل تطوراً طبيعياً. سرعان ما أصبح تحدي حل مشكلات المستخدمين من خلال التفكير التصميمي مدمناً—من رسم رحلات المستخدم إلى صياغة تدفقات العمل البديهية. كل مشروع بدا كلغز، حيث يلتقي الجمال بالوظيفة بسلاسة."
    },
    "development": {
      "title": "استقريت على <accent>التطوير</accent>",
      "description": "غيّر تخصصي في MCT - Devine علاقتي بالبرمجة. ما بدأ كجزء من دراستي تطور سريعاً إلى هوس. بدءاً من تعديلات HTML وCSS البسيطة، سرعان ما وجدت نفسي أبني ألعاب ثنائية الأبعاد، وواجهات تفاعلية، وتطبيقات كاملة. <br></br><br></br> على عكس عملية التصميم التكرارية، قدمت البرمجة تحققاً فورياً—إما أن تعمل أو لا. متعة إحياء التصاميم من خلال الكود، مع فرص التعلم التي لا تنتهي، تبقيني متعلقاً بها حتى اليوم."
    },
    "resume": {
      "title": "السيرة الذاتية <accent>المفصلة</accent>",
      "description": "قم بتحميل سيرتي الذاتية للحصول على نظرة شاملة عن خبراتي ومهاراتي وتعليمي.",
      "lastUpdate": "آخر تحديث: ديسمبر 2024",
      "download": "تحميل السيرة الذاتية"
    },
    "testimonials": {
      "title": "أشخاص <accent>عملت معهم</accent>"
    }
  },
  "projects": {
    "backToProjects": "العودة الى المشاريع",
    "viewSource": "عرض المصدر",
    "visitSite": "زيارة الموقع",
    "timeline": {
      "to": "إلى",
      "present": "الحاضر"
    }
  }
}