{
  "navigation": {
    "home": "Home",
    "projects": "Projects",
    "blog": "Blog",
    "about": "About"
  },
  "footer": {
    "copyright": "© { year } Elomar. All rights reserved.",
    "acknowledgments": "Attributions",
    "credits": "Icons by <lucideLink>Lucide</lucideLink> and illustrations by <illustrationLink>Storyset</illustrationLink>."
  },
  "home": {
    "intro": {
      "greeting": "Hello there!",
      "title": "Sup! I'm Elomar, and I love designing cool experiences.",
      "description": "Hi, I'm Elomar, a web developer and designer who believes in the power of simplicity. I craft solutions that I can be proud of, and explore various topics through my <blog>writing</blog>. Come take a look at what I do."
    },
    "expertise": {
      "title": "Expertise <accent>& experience</accent>",
      "designTitle": "Design with <br></br> <accent>intent</accent>",
      "designDescription": "I design with <strong>purpose</strong>—solving problems and simplifying experiences. By focusing on core user needs, I craft solutions that are clear, effective, and leave a lasting impact.",
      "developTitle": "Develop with <br></br> <accent>precision</accent>",
      "developDescription": "Balancing <strong>quality</strong> and <strong>time efficiency</strong> isn't easy, but finding the optimal solution is where I excel. I bring a methodical approach to every project, ensuring both excellence and timely delivery.",
      "readMore": "Get to know me"
    },
    "work": {
      "title":"Here's some <accent>work</accent>"
    },
    "blog": {
      "title": "Blog articles",
      "readMore": "Read more, it's interesting"
    },
    "contact": {
      "title": "That's all <space></space><accent>folks!</accent>",
      "description": "You've reached the bottom, thank you for visiting! For any inquiries, feel free to click the button down below. Or you can play Space Invaders.",
      "getInTouch": "Get in touch"
    },
    "spaceInvaders": {
      "play": "Play",
      "highScore": "High score",
      "instructions": "[Space-bar] to shoot, [←] and [→] to move"
    }
  },
  "contact": {
    "dropMessage": "Drop a <accent>message</accent>",
    "desciption": "Click the button below to open your default email app (like magic!). I'll admit, I skipped making a custom form with just one useful field. Instead, you can send me your favorite dad joke, or just drop by to say hi!",
    "sendEmail": "Send an email",
    "helloThere": "Hello there",
    "dadJoke": "Why don't skeletons fight each other? Because they don't have the guts!"
  },
  "about": {
    "intro": {
      "title": "Behind the work: <br></br> My <accent>creative path</accent>",
      "description": "Crafting digital solutions through design, code, and creative problem-solving, driven by a photographer's eye and a developer's mind."
    },
    "photography": {
      "title": "Started with <br></br> <accent>photography</accent>",
      "description": "Photography is in my DNA, although a bit rusty. With both parents being photographers, I grew up immersed in their creativity. I mastered Photoshop early on, turning ordinary photos into my playgrounds: I would place people among the clouds, or transform their outfits into some crazy costumes. These early adventures in digital art sparked my journey into design."
    },
    "design": {
      "title": "Explored <accent>design</accent>",
      "description": "Design wasn't a sudden revelation but an organic progression. The challenge of solving user problems through design thinking quickly became addictive—from mapping user journeys to crafting intuitive workflows. Every project felt like a puzzle, where aesthetics seamlessly met functionality."
    },
    "development": {
      "title": "Landed on <accent>development</accent>",
      "description": "Majoring in MCT - Devine transformed my relationship with code. What started as a part of my coursework quickly evolved into an obsession. Starting with simple HTML and CSS tweaks, I soon found myself building 2D games, interactive interfaces, and full-fledged applications. <br></br><br></br> Unlike design's iterative process, coding offered immediate validation—it either worked or it didn't. The joy of bringing designs to life through code, along with endless learning opportunities, keeps me hooked to this day."
    },
    "resume": {
      "title": "Detailed <accent>resume</accent>",
      "description": "Download my resume for a detailed overview of my experience, skills, and education.",
      "lastUpdate": "Last updated: December 2024",
      "download": "Download resume"
    },
    "testimonials": {
      "title": "Superstars I've <accent>worked with</accent>"
    }
  },
  "projects": {
    "intro": {
      "title": "Portfolio"
    },
    "backToProjects": "Back to projects",
    "viewSource": "View Source",
    "visitSite": "Visit Site",
    "timeline": {
      "to": "to",
      "present": "Present"
    },
    "readMore": "Read more",
    "technologies": "Technologies",
    "visitProject": "Visit project"
  }
}
